# coding=utf-8

DATASET_DIR = './datasets/_ALL_/'
OUTPUT_DIR = './datasets/_NPY_/'
GUESS_DIR = 'guess/npy/'

BATCH_SIZE = 16        #must be even
TRIPLET_PER_BATCH = 3

SAVE_PER_EPOCHS = 200
TEST_PER_EPOCHS = 200
CANDIDATES_PER_BATCH = 640       # 18s per batch
TEST_NEGATIVE_No = 99


NUM_FRAMES = 160   # 299 - 16*2
SAMPLE_RATE = 16000
TRUNCATE_SOUND_SECONDS = (0.2, 1.81)  # (start_sec, end_sec)
ALPHA = 0.2
HIST_TABLE_SIZE = 10
NUM_SPEAKERS = 141
DATA_STACK_SIZE = 10

CHECKPOINT_FOLDER = 'checkpoints'
BEST_CHECKPOINT_FOLDER = 'best_checkpoint'

LOSS_LOG= CHECKPOINT_FOLDER + '/losses.txt'
TEST_LOG= CHECKPOINT_FOLDER + '/acc_eer.txt'

PRE_TRAIN = True

COMBINE_MODEL = False
DICT = {0: '暗裔剑魔亚托克斯', 1: '九尾妖狐阿狸', 2: '离群之刺阿卡丽', 3: '殇之木乃伊阿木木', 4: '冰晶凤凰艾尼维亚', 5: '黑暗之女安妮', 6: '寒冰射手艾希', 7: '铸星龙王奥瑞利安索尔', 8: '沙漠皇帝阿兹尔', 9: '星界 游神巴德', 10: '蒸汽机器人布里茨', 11: '复仇焰魂布兰德', 12: '弗雷尔卓德之心布隆', 13: '皮城女警凯特琳', 14: '青钢影卡蜜尔', 15: '魔蛇之拥卡西奥佩娅', 16: '虚空恐惧科加斯', 17: '英勇投弹手库奇', 18: '诺克萨斯之手德莱厄斯', 19: '皎月女神黛安娜', 20: '祖安狂人蒙多医生', 21: ' 荣耀行刑官德莱文', 22: '时间刺客艾克', 23: '蜘蛛女皇伊莉丝', 24: '痛苦之拥伊芙琳', 25: '探险家伊泽瑞尔', 26: '末日使者费德提克', 27: '无双剑姬菲奥娜', 28: '潮汐海灵菲兹', 29: '正义巨像加里奥', 30: '海洋之灾普朗克', 31: '德玛西亚之力盖伦', 32: '迷失之牙纳尔', 33: '酒桶古拉加斯', 34: '法外狂徒格雷福斯', 35: '战争之影赫卡里姆', 36: '大发明家黑默丁格', 37: '海兽祭司俄洛伊', 38: '刀锋舞者艾瑞莉娅', 39: '翠神艾翁', 40: '风暴之怒迦娜', 41: '德玛西亚皇子嘉文四世', 42: '武器大师贾克斯', 43: '未来守护者杰斯', 44: '戏命师烬', 45: '暴走萝莉金克斯', 46: '虚空之女卡莎', 47: '复仇之矛卡莉丝塔', 48: '天启者卡尔玛', 49: '死亡颂唱者卡尔萨斯', 50: '虚空行者卡萨丁', 51: '不详之刃卡特琳娜', 52: '正义天使凯尔', 53: '影流之镰凯隐', 54: '狂暴之心凯南', 55: '虚空掠夺者卡兹克', 56: '永猎双子千珏', 57: '暴怒骑士克烈', 58: '深渊巨口克格莫', 59: '诡术妖姬乐芙兰', 60: '盲僧李青', 61: '曙光女神蕾欧娜', 62: '冰霜女巫丽桑卓', 63: '圣枪游侠卢锡安', 64: '仙灵女巫璐璐', 65: '光辉女郎拉克丝', 66: '熔岩巨兽墨菲特', 67: '虚空先知玛尔扎哈', 68: '扭曲树精茂凯', 69: '无极剑圣易', 70: '赏金猎人厄运小姐', 71: '齐天大圣孙悟空', 72: '铁铠冥魂莫德凯撒', 73: '堕落天使莫甘娜', 74: '唤潮鲛姬娜美', 75: '沙漠死神内瑟斯', 76: '深海泰坦诺提勒斯', 77: '万花通灵妮蔻', 78: '狂野女猎手奈德丽', 79: '雪原双子努努和威朗普', 80: '狂战士奥拉夫', 81: '发条魔灵奥莉安娜', 82: '山隐之焰奥恩', 83: '战争之王潘森', 84: '圣锤之毅波比', 85: '血港鬼影派克', 86: '德玛西亚之翼奎因', 87: '幻翎洛', 88: '披甲龙龟拉莫斯', 89: '虚空遁地兽雷克塞', 90: '荒漠屠夫雷克顿', 91: '傲之追猎者雷恩加尔', 92: '放逐之刃锐雯', 93: '机械公敌兰博', 94: '符文法师瑞兹', 95: '北地之怒瑟庄妮', 96: '恶魔小丑萨科', 97: '暮光之眼慎', 98: '龙血武姬希瓦娜', 99: '炼金术士辛吉德', 100: '亡灵战神赛恩', 101: '战争女神希维尔', 102: '水晶先锋斯卡纳', 103: '琴瑟仙女娑娜', 104: '众星之子索拉卡', 105: '诺克萨斯统领斯维因', 106: '解脱者塞拉斯', 107: '暗黑元首辛德拉', 108: '河流之王塔姆', 109: '岩雀塔莉娅', 110: '刀锋之影泰隆', 111: '瓦罗兰之盾塔里克', 112: '迅捷斥候提莫', 113: '魂锁 典狱长锤石', 114: '麦林炮手崔丝塔娜', 115: '巨魔之王特朗德尔', 116: '蛮族之王泰达米尔', 117: '卡牌大师崔斯特', 118: '瘟 疫之源图奇', 119: '兽灵行者乌迪尔', 120: '无畏战车厄加特', 121: '惩戒之箭韦鲁斯', 122: '暗夜猎手薇恩', 123: '邪恶小法师 维迦', 124: '虚空之眼维克兹', 125: '皮城执法官蔚', 126: '机械先驱维克托', 127: '猩红收割者弗拉基米尔', 128: '雷霆咆哮沃 利贝尔', 129: '祖安巨兽沃里克', 130: '逆羽霞', 131: '远古巫灵泽拉斯', 132: '德邦总管赵信', 133: '疾风剑豪亚索', 134: '牧魂人约里克', 135: '生化魔人扎克', 136: '影流之主劫', 137: '爆破鬼才吉格斯', 138: '时光守护者基兰', 139: '暮光星灵佐伊', 140: '荆棘之兴婕拉'}
